experiments/results/logs/trace_replay-hpa-010/wrk2.txt
Running 30m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4242.868ms, rate sampling interval: 12550ms
  Thread calibration: mean lat.: 4331.131ms, rate sampling interval: 12558ms
  Thread calibration: mean lat.: 4331.267ms, rate sampling interval: 12730ms
  Thread calibration: mean lat.: 4262.816ms, rate sampling interval: 12484ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.79m     5.86m   19.05m    52.27%
    Req/Sec     8.76      2.30    12.00     86.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.63m 
 75.000%   15.27m 
 90.000%   17.44m 
 99.000%   18.77m 
 99.900%   18.91m 
 99.990%   19.00m 
 99.999%   19.05m 
100.000%   19.07m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6434.815     0.000000            1         1.00
   87687.167     0.100000         6651         1.11
  186777.599     0.200000        13292         1.25
  290193.407     0.300000        19937         1.43
  528482.303     0.400000        26597         1.67
  638058.495     0.500000        33245         2.00
  687865.855     0.550000        36575         2.22
  727711.743     0.600000        39903         2.50
  779091.967     0.650000        43206         2.86
  829947.903     0.700000        46527         3.33
  916455.423     0.750000        49845         4.00
  938999.807     0.775000        51527         4.44
  958398.463     0.800000        53166         5.00
  982515.711     0.825000        54834         5.71
 1006108.671     0.850000        56497         6.67
 1024983.039     0.875000        58187         8.00
 1035468.799     0.887500        58981         8.89
 1046478.847     0.900000        59840        10.00
 1058537.471     0.912500        60669        11.43
 1069547.519     0.925000        61504        13.33
 1078984.703     0.937500        62342        16.00
 1083179.007     0.943750        62741        17.78
 1088421.887     0.950000        63216        20.00
 1093664.767     0.956250        63578        22.86
 1099956.223     0.962500        64030        26.67
 1105199.103     0.968750        64461        32.00
 1107296.255     0.971875        64633        35.56
 1110441.983     0.975000        64857        40.00
 1113587.711     0.978125        65053        45.71
 1116733.439     0.981250        65219        53.33
 1120927.743     0.984375        65448        64.00
 1123024.895     0.985938        65596        71.11
 1124073.471     0.987500        65667        80.00
 1125122.047     0.989062        65752        91.43
 1126170.623     0.990625        65838       106.67
 1128267.775     0.992188        66019       128.00
 1128267.775     0.992969        66019       142.22
 1129316.351     0.993750        66116       160.00
 1129316.351     0.994531        66116       182.86
 1130364.927     0.995313        66204       213.33
 1130364.927     0.996094        66204       256.00
 1131413.503     0.996484        66261       284.44
 1131413.503     0.996875        66261       320.00
 1132462.079     0.997266        66318       365.71
 1132462.079     0.997656        66318       426.67
 1133510.655     0.998047        66363       512.00
 1133510.655     0.998242        66363       568.89
 1133510.655     0.998437        66363       640.00
 1134559.231     0.998633        66397       731.43
 1134559.231     0.998828        66397       853.33
 1134559.231     0.999023        66397      1024.00
 1135607.807     0.999121        66416      1137.78
 1135607.807     0.999219        66416      1280.00
 1135607.807     0.999316        66416      1462.86
 1136656.383     0.999414        66429      1706.67
 1136656.383     0.999512        66429      2048.00
 1136656.383     0.999561        66429      2275.56
 1137704.959     0.999609        66439      2560.00
 1137704.959     0.999658        66439      2925.71
 1137704.959     0.999707        66439      3413.33
 1138753.535     0.999756        66447      4096.00
 1138753.535     0.999780        66447      4551.11
 1138753.535     0.999805        66447      5120.00
 1138753.535     0.999829        66447      5851.43
 1138753.535     0.999854        66447      6826.67
 1139802.111     0.999878        66452      8192.00
 1139802.111     0.999890        66452      9102.22
 1139802.111     0.999902        66452     10240.00
 1139802.111     0.999915        66452     11702.86
 1139802.111     0.999927        66452     13653.33
 1139802.111     0.999939        66452     16384.00
 1141899.263     0.999945        66453     18204.44
 1141899.263     0.999951        66453     20480.00
 1142947.839     0.999957        66455     23405.71
 1142947.839     0.999963        66455     27306.67
 1142947.839     0.999969        66455     32768.00
 1142947.839     0.999973        66455     36408.89
 1142947.839     0.999976        66455     40960.00
 1142947.839     0.999979        66455     46811.43
 1142947.839     0.999982        66455     54613.33
 1142947.839     0.999985        66455     65536.00
 1143996.415     0.999986        66456     72817.78
 1143996.415     1.000000        66456          inf
#[Mean    =   587529.403, StdDeviation   =   351714.634]
#[Max     =  1142947.840, Total count    =        66456]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  66799 requests in 30.00m, 684.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 24038
Requests/sec:     37.11
Transfer/sec:    389.65KB